In [134]:
import numpy as np

In [135]:
import pandas as pd

In [136]:
from numpy.random import randn

In [137]:
np.random.seed(101)

In [138]:
randn(5, 8)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575,  0.65111795,
        -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053,  0.18869531,
        -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889,  0.30266545,
         1.69372293, -1.70608593, -1.15911942],
       [-0.13484072,  0.39052784,  0.16690464,  0.18450186,  0.80770591,
         0.07295968,  0.63878701,  0.3296463 ],
       [-0.49710402, -0.7540697 , -0.9434064 ,  0.48475165, -0.11677332,
         1.9017548 ,  0.23812696,  1.99665229]])

In [139]:
df = pd.DataFrame(randn(5, 4), ["a", "b", "c", "d", "e"], ["w", "x", "y", "z"])

In [140]:
df

          w         x         y         z
a -0.993263  0.196800 -1.136645  0.000366
b  1.025984 -0.156598 -0.031579  0.649826
c  2.154846 -0.610259 -0.755325 -0.346419
d  0.147027 -0.479448  0.558769  1.024810
e -0.925874  1.862864 -1.133817  0.610478

In [141]:
one_s = df["w"]

In [142]:
type(one_s)

pandas.core.series.Series

In [143]:
type(df)

pandas.core.frame.DataFrame

In [144]:
df[["x", "z"]]

          x         z
a  0.196800  0.000366
b -0.156598  0.649826
c -0.610259 -0.346419
d -0.479448  1.024810
e  1.862864  0.610478

In [145]:
df["NEW"] = df["w"] + df["y"]

In [146]:
df

          w         x         y         z       NEW
a -0.993263  0.196800 -1.136645  0.000366 -2.129908
b  1.025984 -0.156598 -0.031579  0.649826  0.994405
c  2.154846 -0.610259 -0.755325 -0.346419  1.399521
d  0.147027 -0.479448  0.558769  1.024810  0.705796
e -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [147]:
df.drop("NEW", axis = 1, inplace = True)

In [148]:
df

          w         x         y         z
a -0.993263  0.196800 -1.136645  0.000366
b  1.025984 -0.156598 -0.031579  0.649826
c  2.154846 -0.610259 -0.755325 -0.346419
d  0.147027 -0.479448  0.558769  1.024810
e -0.925874  1.862864 -1.133817  0.610478

In [149]:
df.drop("e", axis = 0)

          w         x         y         z
a -0.993263  0.196800 -1.136645  0.000366
b  1.025984 -0.156598 -0.031579  0.649826
c  2.154846 -0.610259 -0.755325 -0.346419
d  0.147027 -0.479448  0.558769  1.024810

In [150]:
df.shape

(5, 4)

In [151]:
df.loc["a"]

w   -0.993263
x    0.196800
y   -1.136645
z    0.000366
Name: a, dtype: float64

In [152]:
df.iloc[3]

w    0.147027
x   -0.479448
y    0.558769
z    1.024810
Name: d, dtype: float64

In [153]:
df

          w         x         y         z
a -0.993263  0.196800 -1.136645  0.000366
b  1.025984 -0.156598 -0.031579  0.649826
c  2.154846 -0.610259 -0.755325 -0.346419
d  0.147027 -0.479448  0.558769  1.024810
e -0.925874  1.862864 -1.133817  0.610478

In [154]:
df.loc["e", "x"]

1.8628641384939535

In [155]:
df.loc[ ["c", "d"], ["w", "x"] ]

          w         x
c  2.154846 -0.610259
d  0.147027 -0.479448

In [156]:
boolf = df > 0

In [157]:
boolf

       w      x      y      z
a  False   True  False   True
b   True  False  False   True
c   True  False  False  False
d   True  False   True   True
e  False   True  False   True

In [158]:
df[boolf]

          w         x         y         z
a       NaN  0.196800       NaN  0.000366
b  1.025984       NaN       NaN  0.649826
c  2.154846       NaN       NaN       NaN
d  0.147027       NaN  0.558769  1.024810
e       NaN  1.862864       NaN  0.610478

In [159]:
df

          w         x         y         z
a -0.993263  0.196800 -1.136645  0.000366
b  1.025984 -0.156598 -0.031579  0.649826
c  2.154846 -0.610259 -0.755325 -0.346419
d  0.147027 -0.479448  0.558769  1.024810
e -0.925874  1.862864 -1.133817  0.610478

In [160]:
df["w"] > 0

a    False
b     True
c     True
d     True
e    False
Name: w, dtype: bool

In [161]:
df[df["w"] > 0]

          w         x         y         z
b  1.025984 -0.156598 -0.031579  0.649826
c  2.154846 -0.610259 -0.755325 -0.346419
d  0.147027 -0.479448  0.558769  1.024810

In [162]:
resultdf = df[df["z"] > 0]

In [163]:
resultdf

          w         x         y         z
a -0.993263  0.196800 -1.136645  0.000366
b  1.025984 -0.156598 -0.031579  0.649826
d  0.147027 -0.479448  0.558769  1.024810
e -0.925874  1.862864 -1.133817  0.610478

In [164]:
resultdf["x"]

a    0.196800
b   -0.156598
d   -0.479448
e    1.862864
Name: x, dtype: float64

In [165]:
df[df["z"] > 0] [["x", "w"]]

          x         w
a  0.196800 -0.993263
b -0.156598  1.025984
d -0.479448  0.147027
e  1.862864 -0.925874

In [166]:
df.reset_index()

  index         w         x         y         z
0     a -0.993263  0.196800 -1.136645  0.000366
1     b  1.025984 -0.156598 -0.031579  0.649826
2     c  2.154846 -0.610259 -0.755325 -0.346419
3     d  0.147027 -0.479448  0.558769  1.024810
4     e -0.925874  1.862864 -1.133817  0.610478

In [167]:
df.set_index("z")

                  w         x         y
z
 0.000366 -0.993263  0.196800 -1.136645
 0.649826  1.025984 -0.156598 -0.031579
-0.346419  2.154846 -0.610259 -0.755325
 1.024810  0.147027 -0.479448  0.558769
 0.610478 -0.925874  1.862864 -1.133817

In [168]:
df

          w         x         y         z
a -0.993263  0.196800 -1.136645  0.000366
b  1.025984 -0.156598 -0.031579  0.649826
c  2.154846 -0.610259 -0.755325 -0.346419
d  0.147027 -0.479448  0.558769  1.024810
e -0.925874  1.862864 -1.133817  0.610478

In [169]:
df

          w         x         y         z
a -0.993263  0.196800 -1.136645  0.000366
b  1.025984 -0.156598 -0.031579  0.649826
c  2.154846 -0.610259 -0.755325 -0.346419
d  0.147027 -0.479448  0.558769  1.024810
e -0.925874  1.862864 -1.133817  0.610478

In [170]:
df[(df["z"]>0) | (df["w"]>0)]

          w         x         y         z
a -0.993263  0.196800 -1.136645  0.000366
b  1.025984 -0.156598 -0.031579  0.649826
c  2.154846 -0.610259 -0.755325 -0.346419
d  0.147027 -0.479448  0.558769  1.024810
e -0.925874  1.862864 -1.133817  0.610478

In [171]:
df

          w         x         y         z
a -0.993263  0.196800 -1.136645  0.000366
b  1.025984 -0.156598 -0.031579  0.649826
c  2.154846 -0.610259 -0.755325 -0.346419
d  0.147027 -0.479448  0.558769  1.024810
e -0.925874  1.862864 -1.133817  0.610478

In [172]:
df.reset_index()

  index         w         x         y         z
0     a -0.993263  0.196800 -1.136645  0.000366
1     b  1.025984 -0.156598 -0.031579  0.649826
2     c  2.154846 -0.610259 -0.755325 -0.346419
3     d  0.147027 -0.479448  0.558769  1.024810
4     e -0.925874  1.862864 -1.133817  0.610478

In [173]:
df.set_index("z")

                  w         x         y
z
 0.000366 -0.993263  0.196800 -1.136645
 0.649826  1.025984 -0.156598 -0.031579
-0.346419  2.154846 -0.610259 -0.755325
 1.024810  0.147027 -0.479448  0.558769
 0.610478 -0.925874  1.862864 -1.133817

In [174]:
new = "CA NY WY OR CO".split()

In [175]:
new

['CA', 'NY', 'WY', 'OR', 'CO']

In [176]:
df["States"] = new

In [177]:
df

          w         x         y         z States
a -0.993263  0.196800 -1.136645  0.000366     CA
b  1.025984 -0.156598 -0.031579  0.649826     NY
c  2.154846 -0.610259 -0.755325 -0.346419     WY
d  0.147027 -0.479448  0.558769  1.024810     OR
e -0.925874  1.862864 -1.133817  0.610478     CO

In [178]:
df.set_index("States")

               w         x         y         z
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
WY      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

In [179]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [200]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           names=['Groups', 'Numbers'])

In [181]:
df = pd.DataFrame(randn(6, 2), hier_index, ["A", "B"])

In [182]:
df

             A         B
G1 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125
G2 1 -0.031160  1.939932
   2 -1.005187 -0.741790
   3  0.187125 -0.732845

In [183]:
df.loc["G1"]

          A         B
1  0.386030  2.084019
2 -0.376519  0.230336
3  0.681209  1.035125

In [184]:
df.loc["G1"].loc[1]

A    0.386030
B    2.084019
Name: 1, dtype: float64

In [187]:
df.index.names = ["Groups", "Numbers"]

In [188]:
df

                       A         B
Groups Numbers
G1     1        0.386030  2.084019
       2       -0.376519  0.230336
       3        0.681209  1.035125
G2     1       -0.031160  1.939932
       2       -1.005187 -0.741790
       3        0.187125 -0.732845

In [189]:
df

                       A         B
Groups Numbers
G1     1        0.386030  2.084019
       2       -0.376519  0.230336
       3        0.681209  1.035125
G2     1       -0.031160  1.939932
       2       -1.005187 -0.741790
       3        0.187125 -0.732845

In [190]:
df.loc["G1"].loc[3]["A"]

0.6812092925867574

In [192]:
df.xs("G1")

                A         B
Numbers
1        0.386030  2.084019
2       -0.376519  0.230336
3        0.681209  1.035125

In [195]:
df

                       A         B
Groups Numbers
G1     1        0.386030  2.084019
       2       -0.376519  0.230336
       3        0.681209  1.035125
G2     1       -0.031160  1.939932
       2       -1.005187 -0.741790
       3        0.187125 -0.732845

In [199]:
df.xs(1, level = "Numbers")

              A         B
Groups
G1      0.38603  2.084019
G2     -0.03116  1.939932